Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/include/rtl8735b_i2c.h
/**************************************************************************//**
 * @file     rtl819bhp_i2c.h
 * @brief    The fundamental definition for RTL8195B HP i2C module.
 * @version  V1.00
 * @date     2017-03-07
 *
 * @note
 *
 ******************************************************************************
 *
 * Copyright(c) 2007 - 2016 Realtek Corporation. All rights reserved.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the License); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 ******************************************************************************/



#ifndef _RTL8735B_I2C_H_
#define _RTL8735B_I2C_H_

#include "rtl8735b_i2c_type.h"
#include "rtl8735b_peri_id.h"
#ifdef __cplusplus
extern "C" {
#endif
/**
 * @addtogroup hs_hal_i2c I2C
 * @{
 */

//#define LOCAL_SVD_DECLARATION
#undef LOCAL_SVD_DECLARATION
//this flag should be checked again when system integration is done.

#define TX_ABRT_TEMP_PATCH  //This flag should be removed when tx_abrt bit15 is fixed to a correct hardware in DMA mode

/// i2c module number
#define HP_I2C_NO               4
/// i2c IRQ Priority
#define HP_I2C_IRQ_PR           3
/// i2c address retry time-out
#define HP_I2C_ATRY_TO          3000
/// i2c master mode address retry function
#define HP_I2C_ADD_RETRY        1
/// i2c master mode address retry max count
#define HP_I2C_ADD_RTY_MAX      256
/// i2c default DMA TX src width
#define HP_I2C_DMA_DEFAULT_TX_SRC_WIDTH     4
/// i2c default DMA RX des width
#define HP_I2C_DMA_DEFAULT_RX_DES_WIDTH     4
/// i2c timeout check disabled
#define HP_I2C_TIMEOUT_DISABLE  0x00
/// i2c timeout check endless
#define HP_I2C_TIMEOUT_ENDLESS  0xFFFFFFFF
/// i2c TX FIFO entry number
#define HP_I2C_TX_FIFO_DEPTH    32
/// i2c RX FIFO entry number
#define HP_I2C_RX_FIFO_DEPTH    32
/// i2c DMA transfer max length
#define HP_I2C_DMA_MAX_LEN      65535
/// i2c filter CAP. low length
#define HP_I2C_FLTR_CAP_L_LEN   20
/// i2c filter CAP. main length
#define HP_I2C_FLTR_CAP_M_LEN   5
/// i2c filter Resis. low length
#define HP_I2C_FLTR_RSTS_L_LEN  20
/// i2c filter Resis. main length
#define HP_I2C_FLTR_RSTS_M_LEN  20

#define HP_VNDR_ISR_BASE        0x40002800
/** @defgroup i2c_reg_bit_macro I2C REG BIT MACRO
 *  bit-operation macros for i2c registers
 *  @{
 */
/** @} */ // end of I2C REG BIT MACRO

/** \brief i2c mode
*/
enum i2c_mode_e {
	I2CSlaveMode    =   0,                  /*!< 0: for i2c slave mode    */
	I2CMasterMode   =   1,                  /*!< 1: for i2c master mode    */
};

/** \brief i2c read/write
*/
enum i2c_read_write_e {
	I2CWrite        =   0,                  /*!< 0: for i2c write command    */
	I2CRead         =   1,                  /*!< 1: for i2c read command    */
};

/** \brief i2c address mode
*/
enum i2c_addr_mode_e {
	I2CAddress7bit     =   0,               /*!< 0: for i2c 7-bit address mode    */
	I2CAddress10bit    =   1,               /*!< 1: for i2c 10-bit address mode    */
};

/** \brief i2c speed mode
*/
enum i2c_spd_mode_e {
	I2CStandardSpeed    =   1,              /*!< 1: for i2c standard speed mode    */
	I2CFastSpeed        =   2,              /*!< 2: for i2c fast speed mode    */
	I2CHighSpeed        =   3,              /*!< 3: for i2c high speed mode    */
};

/** \brief i2c feature status
*/
enum i2c_enable_status_e {
	I2CDisable      =   0,                  /*!< 0: for i2c disable state    */
	I2CEnable       =   1,                  /*!< 1: for i2c enable state    */
	I2CForceDisable =   2,                  /*!< 2: for i2c force disable enable state    */
};

/** \brief i2c dma type
*/
enum i2c_dma_mod_e {
	I2CDmaDwc   =   0,                      /*!< 0: for i2c dwc dma mode    */
	I2CDmaReg   =   1,                      /*!< 1: for i2c register-based dma mode    */
	I2CDmaDes   =   2,                      /*!< 2: for i2c descritptor mode    */
};

/** \brief i2c general call or start byte
*/
enum i2c_gc_sb_e {
	I2CGeneralCall      =   0,                      /*!< 0: for i2c master could general call    */
	I2CStartByte        =   1,                      /*!< 1: for i2c master could START byte    */
};

/** \brief i2c bus status
*/
enum i2c_bus_status_e {
	I2CBusIdle          =   0,                      /*!< 0: for i2c bus in idle state    */
	I2CBusAddressPhase  =   1,                      /*!< 1: for i2c bus in address phase    */
	I2CBusDataPhase     =   2,                      /*!< 2: for i2c bus in data phase    */
	I2CBusClockStretch  =   3,                      /*!< 2: for i2c bus in clock stretch phase    */
};

/** \brief i2c module state
*/
enum i2c_status_e {
	I2CStatusUninitial      =   0x00,               /*!< 0x00: i2c uninitial state   */
	I2CStatusInitialized    =   0x01,               /*!< 0x01: i2c initialized state   */
	I2CStatusIdle           =   0x02,               /*!< 0x02: i2c idle state   */

	I2CStatusTxReady        =   0x03,               /*!< 0x03: i2c TX ready state   */
	I2CStatusTxing          =   0x04,               /*!< 0x04: i2c TXing state   */

	I2CStatusRxReady        =   0x05,               /*!< 0x05: i2c RX ready state   */
	I2CStatusRxing          =   0x06,               /*!< 0x06: i2c RXing state   */

	I2CStatusDisable        =   0x07,               /*!< 0x07: i2c disabled state   */
	I2CStatusError          =   0x10,               /*!< 0x10: i2c error state   */
	I2CStatusTimeOut        =   0x11,               /*!< 0x11: i2c time-out state   */
};

/** \brief i2c module operation
*/
enum i2c_operation_mode_e {
	I2CModePoll         =   0x00,                   /*!< 0x00: i2c module in poll mode   */
	I2CModeInterrupt    =   0x01,                   /*!< 0x01: i2c module in interrupt mode   */
	I2CModeDMA          =   0x02,                   /*!< 0x02: i2c module in DMA mode   */
};

/** \brief i2c module master special functions
*/
enum i2c_master_speicial_func_e {
	I2CAddressRetry     =   0x01,                   /*!< 0x01: i2c master mode could do address retry   */
	I2CMasterRestart    =   0x02,                   /*!< 0x02: i2c master mode could send RESTART   */
};

