Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/include/rtl8735b_i2c.h
/** \brief i2c module slave special functions
*/
enum i2c_slave_speicial_func_e {
	I2CSlaveRXBySTPSTR =   0x01,                    /*!< 0x01: i2c slave mode receiving would end by STOP or START bit*/
};

/** \brief i2c module error type
*/
enum i2c_err_type_e {
	I2CErrorNone            =   0x00,               /*!< 0x00: i2c has no errors    */
	I2CErrorRxUnder         =   0x01,               /*!< 0x01: i2c has RX underflow error    */
	I2CErrorRxOver          =   0x02,               /*!< 0x02: i2c has RX overflow error    */
	I2CErrorRxDone          =   0x03,               /*!< 0x03: i2c has RX Done error    */
	I2CErrorTxOver          =   0x04,               /*!< 0x04: i2c has TX overflow error    */
	I2CErrorTxAbort         =   0x08,               /*!< 0x08: i2c has TX abort error    */
	I2CErrorSlaveTxNack     =   0x10,               /*!< 0x10: i2c has slave TX NACK error    */

	I2CErrorMasterAddrNack  =   0x12,               /*!< 0x12: i2c master sends address and gets NACK    */
	I2CErrorMasterDataNack  =   0x13,               /*!< 0x13: i2c master sends data and gets NACK    */
	I2CErrorMasterLostArb   =   0x14,               /*!< 0x14: i2c master lost bus arbitration    */

	I2CErrorRxCmdTimeOut    =   0x21,               /*!< 0x21: i2c master sends RX command and time-out happens    */
	I2CErrorRxFIFOTimeOut   =   0x22,               /*!< 0x22: i2c read RX data and time-out happens    */
	I2CErrorTxCmdTimeOut    =   0x23,               /*!< 0x23: i2c master sends TX command and time-out happens    */
	I2CErrorTxFIFOTimeOut   =   0x24,               /*!< 0x24: i2c fill TX data and time-out happens    */

	I2CErrorTxAddrTimeOut   =   0x25,               /*!< 0x25: i2c master sends TX address retry and time-out happens    */
	I2CErrorRxAddrTimeOut   =   0x26,               /*!< 0x26: i2c master sends RX address retry and time-out happens    */
	I2CErrorTarTimeOut      =   0x27,               /*!< 0x27: i2c master sets target address and time-out happens    */

	I2CErrorSlaveLostArb    =   0x30,               /*!< 0x30: i2c slave lost bus arbitration    */
	I2CErrorSlaveFlushFIFO  =   0x31,               /*!< 0x31: i2c slave flushes FIFO when getting RD Req. and TX FIFO
                                                               is NOT empty. */
	I2CErrorSlaveRDCmdInTX  =   0x32,               /*!< 0x32: i2c slave acts as a transmitter and a Read Cmd written
                                                               into TX FIFO */
};

/** \brief i2c dma channel status
*/
enum i2c_dma_ch_status_e {
	I2CDmaChNone            =   0x00,               /*!< 0x00: i2c got no channel    */
	I2CDmaChGot             =   0x01,               /*!< 0x00: i2c got a channel    */
	I2CDmaChInitialed       =   0x02,               /*!< 0x00: i2c got a channel and initialized it    */
};

/*  Macros for i2c SCL timing constant  */
/** @defgroup i2c_reg_scl_clock_constant I2C REG SCL CLOCK CONSTANT
 *  i2c SCL timing constant
 *  @{
 */
#define I2C_SS_MIN_SCL_HTIME    4000        //the unit is ns.
#define I2C_SS_MIN_SCL_LTIME    4700        //the unit is ns.

#define I2C_FS_MODIFY
#ifdef I2C_FS_MODIFY
#define I2C_FS_MIN_SCL_HTIME    900         //the unit is ns.
#define I2C_FS_MIN_SCL_LTIME    1000        //the unit is ns.
#else
#define I2C_FS_MIN_SCL_HTIME    600         //the unit is ns.
#define I2C_FS_MIN_SCL_LTIME    1300        //the unit is ns.
#endif

#define I2C_HS_MIN_SCL_HTIME_100    60      //the unit is ns, with bus loading = 100pf
#define I2C_HS_MIN_SCL_LTIME_100    120     //the unit is ns., with bus loading = 100pf

#define I2C_HS_MIN_SCL_HTIME_400    160     //the unit is ns, with bus loading = 400pf
#define I2C_HS_MIN_SCL_LTIME_400    320     //the unit is ns., with bus loading = 400pf

#define I2C_SS_HTIME_MIN        3
#define I2C_SS_LTIME_MIN        5

#define I2C_FS_HTIME_MIN        3
#define I2C_FS_LTIME_MIN        5

#define I2C_HS_HTIME_MIN        3
#define I2C_HS_LTIME_MIN        5

#define I2C_MST_SDA_HOLD_MIN    1
#define I2C_SLV_SDA_HOLD_MIN    7
/** @} */ // end of I2C REG SCL CLOCK CONSTANT

/** \brief i2c initail data structure */
typedef struct i2c_init_dat_s {
	uint8_t     index;                          /*!< Offset: 0x000   i2c index   */
	uint8_t     enable;                         /*!< Offset: 0x001   i2c enable state, updated by HAL   */
	uint8_t     master;                         /*!< Offset: 0x002   i2c master/slave state   */
	uint8_t     addr_mod;                       /*!< Offset: 0x003   i2c address mode   */

	uint8_t     spd_mod;                        /*!< Offset: 0x004   i2c speed mode   */
	uint8_t     sda_setup;                      /*!< Offset: 0x005   i2c SDA setup time   */
	uint8_t     ff_rxtl;                        /*!< Offset: 0x006   i2c RX FIFO Threshold, for RX_FULL state  */
	uint8_t     ff_txtl;                        /*!< Offset: 0x007   i2c TX FIFO Threshold, for TX_EMPTY state   */

	uint32_t    clock;                          /*!< Offset: 0x008   i2c SCL clock   */

	uint16_t    ack_addr0;                      /*!< Offset: 0x00c   i2c default target address in master mode,
                                                                 acknowledge address 0 in slave mode    */
	uint16_t    ack_addr1;                      /*!< Offset: 0x00e   i2c acknowledge address 1 in slave mode(only for slave)
                                                                 */

	uint16_t    sda_hold;                       /*!< Offset: 0x010   i2c SDA hold time   */
	uint8_t     bus_ld;                         /*!< Offset: 0x012   i2c bus loading   */
	uint8_t     dig_fltr_en;                    /*!< Offset: 0x013   i2c digital filter control   */

	uint8_t     dma_mod;                        /*!< Offset: 0x014   i2c DMA operation mode   */
	uint8_t     tx_dma_rq_lv;                   /*!< Offset: 0x015   i2c DMA TX request FIFO level   */
	uint8_t     rx_dma_rq_lv;                   /*!< Offset: 0x016   i2c DMA RX request FIFO level   */
	uint8_t     rx_dma_rq_lv_s1;                /*!< Offset: 0x017   i2c DMA RX request FIFO level for slave address 1  */

	I2C_TypeDef   *reg_base;                      /*!< Offset: 0x018   i2c register base address  */
	uint8_t     dig_fltr_lvl;                   /*!< Offset: 0x01C   i2c digital filter level  */
	uint8_t     hs_maddr;                       /*!< Offset: 0x01D   i2c high speed master code, only lsb 3 bits valid  */
	uint16_t    rsvd1;                          /*!< Offset: 0x01E   reserved 1  */
} i2c_init_dat_t, *pi2c_init_dat_t;

/** \brief i2c user callback adaptor
*/
typedef struct i2c_user_callback_adpt_s {
	VOID (*cb)(VOID *data);                         /*! i2c callback function */
	uint32_t    dat;                                /*! i2c callback function argument */
} i2c_user_callback_adpt_t, *pi2c_user_callback_adpt_t;

/** \brief i2c user callback
*/
typedef struct i2c_user_callback_s {
	i2c_user_callback_adpt_t  tx_empty;             /*! i2c transmit callback */
	i2c_user_callback_adpt_t  txc;                  /*! i2c transmit complete callback */
	i2c_user_callback_adpt_t  rx_full;              /*! i2c receive callback */
	i2c_user_callback_adpt_t  rxc;                  /*! i2c receive complete callback */
	i2c_user_callback_adpt_t  rd_req;               /*! i2c read request callback */
	i2c_user_callback_adpt_t  err;                  /*! i2c error callback */
	i2c_user_callback_adpt_t  dma_tx;               /*! i2c dma transmit callback */
	i2c_user_callback_adpt_t  dma_txc;              /*! i2c dma transmit complete callback */
	i2c_user_callback_adpt_t  dma_rx;               /*! i2c dma receive callback */
	i2c_user_callback_adpt_t  dma_rxc;              /*! i2c dma receive complete callback */
	i2c_user_callback_adpt_t  gen_call;             /*! i2c general call callback */
	i2c_user_callback_adpt_t  wake;                 /*! i2c wake up callback */
} i2c_user_callback_t, *pi2c_user_callback_t;

/** \brief i2c platform related data
*/
typedef struct i2c_platform_data_s {
#if IS_CUT_TEST(CONFIG_CHIP_VER)
	uint8_t         scl_pin;                        /*! i2c scl pin */
	uint8_t         sda_pin;                        /*! i2c scl pin */
#else
	uint32_t 		scl_pin;						/*! i2c scl pin */
	uint32_t 		sda_pin;						/*! i2c scl pin */

#endif
	uint8_t         rsvd0;                          /*! reserved 0 */
	uint8_t         tx_dma_bound;                   /*! i2c low bound to do tx-dma transmission,
                                                        if tx len is less than this bound, tx API
                                                        would change to poll mode transmission.*/
	uint8_t         rx_dma_bound;                   /*! i2c low bound to do rx-dma transmission,
                                                        if tx len is less than this bound, tx API
                                                        would change to poll mode transmission.*/
	uint32_t        tr_time_out;                    /*! i2c transmission time-out count */
} i2c_platform_data_t, *pi2c_platform_data_t;

/** \brief i2c transmit information (master/slave)
*/
typedef struct i2c_tx_info_s {
	uint16_t        addr;                           /*! i2c target address for master mode    */
	uint8_t         mst_stop;                       /*! i2c stop control for master mode    */
	uint8_t         rsvd0;                          /*! reserved 0   */
	const uint8_t *buf;                            /*! i2c trassmit data buffer pointer    */
	uint32_t        len;                            /*! i2c transmit data length    */
} i2c_tx_info_t, *pi2c_tx_info_t;

/** \brief i2c receive information (master/slave)
*/
typedef struct i2c_rx_info_s {
	uint16_t        addr;                           /*! i2c target address for master mode    */
	uint8_t         mst_stop;                       /*! i2c stop control for master mode    */
	uint8_t         rsvd0;                          /*! reserved 0   */
	uint8_t *buf;                            /*! i2c receive data buffer pointer    */
	uint32_t        len;                            /*! i2c receive data length    */
} i2c_rx_info_t, *pi2c_rx_info_t;

/** \brief i2c dma information (master/slave)
*/
typedef struct i2c_dma_info_s {
	hal_gdma_adaptor_t  *padaptor;                  /*! i2c dma adaptor     */
	irq_config_t        irq_config;                 /*! i2c dma interrupt handler     */
	uint8_t             ch_sts;                     /*! i2c dma channel status (i2c local)     */
	uint32_t            dat_len;                    /*! i2c original dma data length (i2c local)     */
} i2c_dma_info_t, *pi2c_dma_info_t;

/** \brief i2c control adapter
*/
typedef struct hal_i2c_adapter_s {
	volatile uint8_t    status;                     /*! i2c module status    */
	uint8_t             op_mode;                    /*! i2c module operation mode    */
	uint8_t             mst_spe_func;               /*! i2c module master special function    */
	uint8_t             slv_spe_func;               /*! i2c module slave special function    */
	volatile uint32_t   err_type;                   /*! i2c module error type    */
	i2c_init_dat_t      init_dat;                   /*! i2c initial data     */
	i2c_platform_data_t pltf_dat;                   /*! i2c platform data     */
	i2c_user_callback_t usr_cb;                     /*! i2c user callback     */
	irq_config_t        irq_config;                 /*! i2c interrupt handler     */
	i2c_tx_info_t       tx_dat;                     /*! i2c transmit information     */
	i2c_rx_info_t       rx_dat;                     /*! i2c receive information     */
	uint32_t            rd_cmd_no;                  /*! i2c read command number (master only)     */
	i2c_dma_info_t      tx_dma_dat;                 /*! i2c transmit dma data   */
	i2c_dma_info_t      rx_dma_dat;                 /*! i2c receive dma data   */
	void (*dcache_invalidate_by_addr)(uint32_t *addr, int32_t dsize);   /*! callback function to do the D-cache invalidate  */
	void (*dcache_clean_by_addr)(uint32_t *addr, int32_t dsize);        /*! callback function to do the D-cache clean  */
	void (*dcache_clean_invalidate_by_addr)(uint32_t *addr, int32_t dsize);       /*! callback function to do the D-cache clean
                                                                                       and invalidate */
	uint32_t            rsvd0;                      /*! reserved 0    */
} hal_i2c_adapter_t, *phal_i2c_adapter_t;

/** \brief Description of hal_i2c_write32
 *
 *    hal_i2c_write32 is used for general register write operation.
 *
 *   \param[in] uint32_t index:     i2c index
 *   \param[in] uint32_t reg:       register offset
 *   \param[in] uint32_t val:       register value
 */
static inline void hal_i2c_write32(uint8_t index, uint32_t reg, uint32_t val)
{
	switch (index) {
	case 0:
		HAL_WRITE32(I2C0_BASE, reg, val);
		break;
	case 1:
		HAL_WRITE32(I2C1_BASE, reg, val);
		break;
	case 2:
		HAL_WRITE32(I2C2_BASE, reg, val);
		break;
	case 3:
		HAL_WRITE32(I2C3_BASE, reg, val);
		break;
	default:
		break;
	}
}

/** \brief Description of hal_i2c_read32
 *
 *    hal_i2c_read32 is used for general register read operation.
 *
 *   \param[in] uint32_t index:     i2c index
 *   \param[in] uint32_t reg:       register offset
 *   \return uint32_t:          register value in 32-bit
 */
static inline uint32_t hal_i2c_read32(uint8_t index, uint32_t reg)
{
	switch (index) {
	case 0:
		return (uint32_t)(HAL_READ32(I2C0_BASE, reg));
	case 1:
		return (uint32_t)(HAL_READ32(I2C1_BASE, reg));
	case 2:
		return (uint32_t)(HAL_READ32(I2C2_BASE, reg));
	case 3:
		return (uint32_t)(HAL_READ32(I2C3_BASE, reg));
	default:
		break;
	}

