Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/include/rtl8735b_i2c.h
	return (uint32_t)0xFFFFFFFF;
}

/** \brief Description of hal_rtl_i2c_idx_chk
 *
 *    hal_rtl_i2c_idx_chk is used for checking i2c module is available or not
 *
 *   \param[in] uint8_t idx:     I2C index
 *   \return HAL_Status.
 */
static inline hal_status_t hal_rtl_i2c_idx_chk(uint8_t idx)
{
	if ((idx > 3)) {
		DBG_I2C_ERR("Index(%d) is out of range", idx);
		return HAL_ERR_PARA;
	}

	return HAL_OK;
}

/** \brief Description of hal_rtl_i2c_slv_set_for_mst_rd_cmd
 *
 *    hal_rtl_i2c_slv_set_for_mst_rd_cmd is to set interrupt mask for Read Request interrupt which is from
 *    other masters.
 *
 *   \param[in] hal_i2c_adapter_t *phal_i2c_adapter:   pointer to I2C control adapter.
 *   \return void
 */
static inline void hal_rtl_i2c_slv_set_for_mst_rd_cmd(hal_i2c_adapter_t *phal_i2c_adapter)
{
	HAL_SET_BIT(phal_i2c_adapter->init_dat.reg_base->I2C_INTR_MSK, I2C_BIT_M_RD_REQ);
}

/** \brief Description of hal_rtl_i2c_slv_clear_for_mst_rd_cmd
 *
 *    hal_rtl_i2c_slv_clear_for_mst_rd_cmd is to clear interrupt mask for Read Request interrupt which is from
 *    other masters.
 *
 *   \param[in] hal_i2c_adapter_t *phal_i2c_adapter:   pointer to I2C control adapter.
 *   \return void
 */
static inline void hal_rtl_i2c_slv_clear_for_mst_rd_cmd(hal_i2c_adapter_t *phal_i2c_adapter)
{
	HAL_CLEAR_BIT(phal_i2c_adapter->init_dat.reg_base->I2C_INTR_MSK, I2C_BIT_M_RD_REQ);
}

typedef struct hal_i2c_pin_s {
	uint8_t sda;
	uint8_t scl;
	uint8_t eol;    // end of list
} hal_i2c_pin_t, *phal_i2c_pin_t;

typedef struct hal_i2c_group_adapter_s {
	hal_i2c_adapter_t *adapter[HP_I2C_NO + 1];   /*!< All the I2C adapters of this platform */
	irq_handler_t   irq_fun[HP_I2C_NO + 1];   /*!< the IRQ handler for different I2C adapters */
} hal_i2c_group_adapter_t, *phal_i2c_group_adapter_t;

/*  Macros for i2c essential operation  */
/** @defgroup i2c_reg_access_macro I2C REG ACCESS MACRO
 *  i2c register access macro
 *  @{
 */
#define HAL_I2C_WRITE32(idx, addr, value)    hal_i2c_write32(idx, (uint32_t)addr,value)
#define HAL_I2C_READ32(idx, addr)            hal_i2c_read32(idx, (uint32_t)addr)
#define READ_CLEAR_I2C_REG(base, reg_name)   base->reg_name
#define I2C_BASE_REG        ((I2C_TypeDef *) 0)
/** @} */ // end of I2C REG ACCESS MACRO

uint8_t hal_rtl_i2c_timeout_chk(hal_i2c_adapter_t *phal_i2c_adapter, uint32_t start_cnt);
void hal_rtl_i2c_dma_irq_handler(void *data);
void hal_rtl_i2c_mst_irq_handler(void *data);
void hal_rtl_i2c_slv_irq_handler(void *data);
uint8_t hal_rtl_i2c_chk_mod(hal_i2c_adapter_t *phal_i2c_adapter);
uint8_t hal_rtl_i2c_pure_init(hal_i2c_adapter_t *phal_i2c_adapter);
uint8_t hal_rtl_i2c_pure_deinit(hal_i2c_adapter_t *phal_i2c_adapter);
uint8_t hal_rtl_i2c_en_ctrl(hal_i2c_adapter_t *phal_i2c_adapter, uint8_t enable);
hal_status_t hal_rtl_i2c_set_clk(hal_i2c_adapter_t *phal_i2c_adapter);
hal_status_t hal_rtl_i2c_intr_ctrl(hal_i2c_adapter_t *phal_i2c_adapter, uint8_t set_clr, uint16_t intr_msk);
hal_status_t hal_rtl_i2c_wr(hal_i2c_adapter_t *phal_i2c_adapter, const uint8_t *dat_buf, uint32_t dat_len, uint8_t ctrl);
void hal_rtl_i2c_mst_send_rdcmd(hal_i2c_adapter_t *phal_i2c_adapter, uint32_t cmd_len, uint8_t ctrl);
uint32_t hal_rtl_i2c_dma_ctrl(hal_i2c_adapter_t *phal_i2c_adapter, uint8_t enable);
hal_status_t hal_rtl_i2c_mst_restr_ctrl(hal_i2c_adapter_t *phal_i2c_adapter, uint8_t restr_en);
hal_status_t hal_rtl_i2c_mst_gc_sb_ctrl(hal_i2c_adapter_t *phal_i2c_adapter, uint8_t enable, uint8_t gc_sb);
hal_status_t hal_rtl_i2c_slv_no_ack_ctrl(hal_i2c_adapter_t *phal_i2c_adapter, uint8_t no_ack_en);
uint8_t hal_rtl_i2c_slv_no_ack_sts(hal_i2c_adapter_t *phal_i2c_adapter);
hal_status_t hal_rtl_i2c_slv_ack_gc_ctrl(hal_i2c_adapter_t *phal_i2c_adapter, uint8_t slv_gc_en);
uint8_t hal_rtl_i2c_slv_ack_gc_sts(hal_i2c_adapter_t *phal_i2c_adapter);
hal_status_t hal_rtl_i2c_slv_to_slp(hal_i2c_adapter_t *phal_i2c_adapter);
uint8_t hal_rtl_i2c_slv_chk_mst_wr(hal_i2c_adapter_t *phal_i2c_adapter);
uint8_t hal_rtl_i2c_slv_chk_rd_req(hal_i2c_adapter_t *phal_i2c_adapter);
hal_status_t hal_rtl_i2c_pin_init(hal_i2c_adapter_t *phal_i2c_adapter);
hal_status_t hal_rtl_i2c_pin_deinit(hal_i2c_adapter_t *phal_i2c_adapter);
void hal_rtl_i2c_reg_comm_irq(hal_i2c_adapter_t *phal_i2c_adapter, irq_handler_t handler);
void hal_rtl_i2c_reg_irq(hal_i2c_adapter_t *phal_i2c_adapter, irq_handler_t handler);
uint8_t hal_rtl_i2c_unreg_irq(hal_i2c_adapter_t *phal_i2c_adapter);
hal_status_t hal_rtl_i2c_init(hal_i2c_adapter_t *phal_i2c_adapter);
hal_status_t hal_rtl_i2c_deinit(hal_i2c_adapter_t *phal_i2c_adapter);
hal_status_t hal_rtl_i2c_load_default(hal_i2c_adapter_t *phal_i2c_adapter, uint8_t index);
hal_status_t hal_rtl_i2c_set_tar(hal_i2c_adapter_t *phal_i2c_adapter, uint8_t mst_rw);
hal_status_t hal_rtl_i2c_send_addr_retry(hal_i2c_adapter_t *phal_i2c_adapter);
hal_status_t hal_rtl_i2c_send_poll(hal_i2c_adapter_t *phal_i2c_adapter);
hal_status_t hal_rtl_i2c_send_intr(hal_i2c_adapter_t *phal_i2c_adapter);
//hal_status_t hal_rtl_i2c_send_dma_init (hal_i2c_adapter_t *phal_i2c_adapter);
//hal_status_t hal_rtl_i2c_send_dma_deinit (hal_i2c_adapter_t *phal_i2c_adapter);
//hal_status_t hal_rtl_i2c_send_dma (hal_i2c_adapter_t *phal_i2c_adapter);
//hal_status_t hal_rtl_i2c_send (hal_i2c_adapter_t *phal_i2c_adapter);
hal_status_t hal_rtl_i2c_recv_addr_retry(hal_i2c_adapter_t *phal_i2c_adapter);
hal_status_t hal_rtl_i2c_recv_poll(hal_i2c_adapter_t *phal_i2c_adapter);
hal_status_t hal_rtl_i2c_recv_intr(hal_i2c_adapter_t *phal_i2c_adapter);
//hal_status_t hal_rtl_i2c_recv_dma_init (hal_i2c_adapter_t *phal_i2c_adapter);
//hal_status_t hal_rtl_i2c_recv_dma_deinit (hal_i2c_adapter_t *phal_i2c_adapter);
//hal_status_t hal_rtl_i2c_recv_dma (hal_i2c_adapter_t *phal_i2c_adapter);
//hal_status_t hal_rtl_i2c_receive (hal_i2c_adapter_t *phal_i2c_adapter);
hal_status_t hal_rtl_i2c_set_sar(hal_i2c_adapter_t *phal_i2c_adapter, uint8_t sar_idx, uint16_t slv_addr);
uint32_t hal_rtl_i2c_slv_recv_poll(hal_i2c_adapter_t *phal_i2c_adapter);
uint32_t hal_rtl_i2c_slv_recv_intr(hal_i2c_adapter_t *phal_i2c_adapter);
//uint32_t hal_rtl_i2c_slv_recv_dma (hal_i2c_adapter_t *phal_i2c_adapter);
//hal_status_t hal_rtl_i2c_slv_recv (hal_i2c_adapter_t *phal_i2c_adapter);
uint32_t hal_rtl_i2c_slv_send_poll(hal_i2c_adapter_t *phal_i2c_adapter);
uint32_t hal_rtl_i2c_slv_send_intr(hal_i2c_adapter_t *phal_i2c_adapter);
//uint32_t hal_rtl_i2c_slv_send_dma (hal_i2c_adapter_t *phal_i2c_adapter);
//hal_status_t hal_rtl_i2c_slv_send (hal_i2c_adapter_t *phal_i2c_adapter);

/**
  \brief  The data structure of the stubs function for the I2C HAL functions in ROM
*/
typedef struct hal_i2c_func_stubs_s {
	hal_pin_map *hal_i2c_scl_pin_map;
	hal_pin_map *hal_i2c_sda_pin_map;
	hal_i2c_group_adapter_t *hal_i2c_group_adpt;
	uint8_t (*hal_i2c_timeout_chk)(hal_i2c_adapter_t *phal_i2c_adapter, uint32_t start_cnt);
	uint8_t (*hal_i2c_chk_mod)(hal_i2c_adapter_t *phal_i2c_adapter);
	uint8_t (*hal_i2c_pure_init)(hal_i2c_adapter_t *phal_i2c_adapter);
	uint8_t (*hal_i2c_pure_deinit)(hal_i2c_adapter_t *phal_i2c_adapter);
	uint8_t (*hal_i2c_en_ctrl)(hal_i2c_adapter_t *phal_i2c_adapter, uint8_t enable);
	hal_status_t (*hal_i2c_set_clk)(hal_i2c_adapter_t *phal_i2c_adapter);
	hal_status_t (*hal_i2c_intr_ctrl)(hal_i2c_adapter_t *phal_i2c_adapter, uint8_t set_clr, uint16_t intr_msk);
	hal_status_t (*hal_i2c_wr)(hal_i2c_adapter_t *phal_i2c_adapter, const uint8_t *dat_buf, uint32_t dat_len, uint8_t ctrl);
	void (*hal_i2c_mst_send_rdcmd)(hal_i2c_adapter_t *phal_i2c_adapter, uint32_t cmd_len, uint8_t ctrl);
	uint32_t (*hal_i2c_dma_ctrl)(hal_i2c_adapter_t *phal_i2c_adapter, uint8_t enable);
	hal_status_t (*hal_i2c_mst_restr_ctrl)(hal_i2c_adapter_t *phal_i2c_adapter, uint8_t restr_en);
	hal_status_t (*hal_i2c_mst_gc_sb_ctrl)(hal_i2c_adapter_t *phal_i2c_adapter, uint8_t enable, uint8_t gc_sb);
	hal_status_t (*hal_i2c_slv_no_ack_ctrl)(hal_i2c_adapter_t *phal_i2c_adapter, uint8_t no_ack_en);
	uint8_t (*hal_i2c_slv_no_ack_sts)(hal_i2c_adapter_t *phal_i2c_adapter);
	hal_status_t (*hal_i2c_slv_ack_gc_ctrl)(hal_i2c_adapter_t *phal_i2c_adapter, uint8_t slv_gc_en);
	uint8_t (*hal_i2c_slv_ack_gc_sts)(hal_i2c_adapter_t *phal_i2c_adapter);
	hal_status_t (*hal_i2c_slv_to_slp)(hal_i2c_adapter_t *phal_i2c_adapter);
	uint8_t (*hal_i2c_slv_chk_mst_wr)(hal_i2c_adapter_t *phal_i2c_adapter);
	uint8_t (*hal_i2c_slv_chk_rd_req)(hal_i2c_adapter_t *phal_i2c_adapter);
	hal_status_t (*hal_i2c_pin_init)(hal_i2c_adapter_t *phal_i2c_adapter);
	hal_status_t (*hal_i2c_pin_deinit)(hal_i2c_adapter_t *phal_i2c_adapter);
	void (*hal_i2c_reg_comm_irq)(hal_i2c_adapter_t *phal_i2c_adapter, irq_handler_t handler);
	void (*hal_i2c_reg_irq)(hal_i2c_adapter_t *phal_i2c_adapter, irq_handler_t handler);
	uint8_t (*hal_i2c_unreg_irq)(hal_i2c_adapter_t *phal_i2c_adapter);

	hal_status_t (*hal_i2c_init)(hal_i2c_adapter_t *phal_i2c_adapter);
	hal_status_t (*hal_i2c_deinit)(hal_i2c_adapter_t *phal_i2c_adapter);
	hal_status_t (*hal_i2c_load_default)(hal_i2c_adapter_t *phal_i2c_adapter, uint8_t index);
	hal_status_t (*hal_i2c_set_tar)(hal_i2c_adapter_t *phal_i2c_adapter, uint8_t mst_rw);
	hal_status_t (*hal_i2c_send_addr_retry)(hal_i2c_adapter_t *phal_i2c_adapter);
	hal_status_t (*hal_i2c_send_poll)(hal_i2c_adapter_t *phal_i2c_adapter);
	hal_status_t (*hal_i2c_send_intr)(hal_i2c_adapter_t *phal_i2c_adapter);
	//hal_status_t (*hal_i2c_send_dma_init) (hal_i2c_adapter_t *phal_i2c_adapter);
	//hal_status_t (*hal_i2c_send_dma_deinit) (hal_i2c_adapter_t *phal_i2c_adapter);
	//hal_status_t (*hal_i2c_send_dma) (hal_i2c_adapter_t *phal_i2c_adapter);
	//hal_status_t (*hal_i2c_send) (hal_i2c_adapter_t *phal_i2c_adapter);
	hal_status_t (*hal_i2c_recv_addr_retry)(hal_i2c_adapter_t *phal_i2c_adapter);
	hal_status_t (*hal_i2c_recv_poll)(hal_i2c_adapter_t *phal_i2c_adapter);
	hal_status_t (*hal_i2c_recv_intr)(hal_i2c_adapter_t *phal_i2c_adapter);
	//hal_status_t (*hal_i2c_recv_dma_init) (hal_i2c_adapter_t *phal_i2c_adapter);
	//hal_status_t (*hal_i2c_recv_dma_deinit) (hal_i2c_adapter_t *phal_i2c_adapter);
	//hal_status_t (*hal_i2c_recv_dma) (hal_i2c_adapter_t *phal_i2c_adapter);
	//hal_status_t (*hal_i2c_receive) (hal_i2c_adapter_t *phal_i2c_adapter);
	hal_status_t (*hal_i2c_set_sar)(hal_i2c_adapter_t *phal_i2c_adapter, uint8_t sar_idx, uint16_t slv_addr);
	uint32_t (*hal_i2c_slv_recv_poll)(hal_i2c_adapter_t *phal_i2c_adapter);
	uint32_t (*hal_i2c_slv_recv_intr)(hal_i2c_adapter_t *phal_i2c_adapter);
	//uint32_t (*hal_i2c_slv_recv_dma) (hal_i2c_adapter_t *phal_i2c_adapter);
	//hal_status_t (*hal_i2c_slv_recv) (hal_i2c_adapter_t *phal_i2c_adapter);
	uint32_t (*hal_i2c_slv_send_poll)(hal_i2c_adapter_t *phal_i2c_adapter);
	uint32_t (*hal_i2c_slv_send_intr)(hal_i2c_adapter_t *phal_i2c_adapter);
	//uint32_t (*hal_i2c_slv_send_dma) (hal_i2c_adapter_t *phal_i2c_adapter);
	//hal_status_t (*hal_i2c_slv_send) (hal_i2c_adapter_t *phal_i2c_adapter);
	void (*hal_i2c_dma_irq_handler)(void *data);
	void (*hal_i2c_mst_irq_handler)(void *data);
	void (*hal_i2c_slv_irq_handler)(void *data);
	uint32_t reserved[19];  // reserved space for next ROM code version function table extending.
} hal_i2c_func_stubs_t;

/** @} */ /* End of group hs_hal_i2c */

#ifdef __cplusplus
}
#endif

#endif /* _RTL8735B_I2C_H_ */

